#opencv繪圖
import numpy as np
import cv2

img=np.zeros([400,500,3],dtype='uint8') #定義數位影像 #np.zeros()全黑
cv2.line(img,(50,50),(150,150),(255,0,0),2,cv2.LINE_AA,0) #直線
        #影像 #座標1  #座標2     #顏色  #線寬 #線的型態 #點座標的小數位數
cv2.rectangle(img,(200,50),(300,150),(0,225,0),-1) #矩形
            #影像  #座標1    #座標2    #顏色    #線寬(-1:填滿)
cv2.circle(img,(400,100),50,(0,0,225),-1) #圓形
          #影像 #圓心座標 #半徑 #顏色  #線寬(-1:填滿)
cv2.ellipse(img,(100,300),(60,40),  135,     0,        360,(255,225,0),-1) #橢圓形
          #影像 #圓心座標 #半個主軸 #旋轉角度 #開始角度 #結束角度 #顏色 #線寬(-1:填滿)
points=np.array([[200,220],[220,300],[280,320],[300,250]])
cv2.polylines(img,[points],True,(255,0,255)) #多邊行
             #影像 #點座標 #是否封閉 #顏色
points=np.array([[400,220],[350,300],[420,350],[450,250]])
cv2.fillPoly(img,[points],(255,255,0)) #填滿多邊行
          #影像   #點座標  #顏色
cv2.imshow("Example",img)
cv2.waitKey(0)